//Задача 5. Алгоритм сжатия данных Хаффмана
//        (6 баллов и более)
//Напишите две функции для создания архива из одного файла и извлечения файла из архива.
//Требования: коэффициент сжатия < 1.
//В архиве сохраняйте дерево Хаффмана и код Хаффмана от исходных данных.
//Дерево Хаффмана требуется хранить эффективно - не более 10 бит на каждый 8-битный символ.
//В контест необходимо отправить .cpp файл содержащий функции Encode, Decode, а также включающий файл Huffman.h. Тестирующая программа выводит размер сжатого файла в процентах от исходного.
//
//Лучшие 3 решения с коэффициентом сжатия < 1 из каждой группы оцениваются в 10, 7 и 4 баллов соответственно.
//
